SpenceKonde/DxCore/megaavr/variants/32pin-ebseries/pins_arduino.h
/*  (C) Spence Konde 2021-2025 open source (LGPL2.1 see LICENSE.md) based on existing Arduino cores.*/
//                                                                                    *INDENT-OFF*
/*
 ###  #     # ####      ####  ####      ###   ##
#   # #     # #   #     #     #   #        # #  #           #
#####  #   #  ####      ###   ####       ##    #   ### ###     ###
#   #   # #   #  #      #     #   #        #  #        #  # #  #  #
#   #    #    #   #     ####  ####      ###  ####      ###  #  #  #
===================================     ----------     #
Variant Definition file for generic EB parts           #
with 32 pins.

Part Numbers
AVR32EB32 AVR16EB32

Include guard and include basic libraries. We are normally including this inside Arduino.h */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

#define EB_32PIN_PINOUT

 /*##  ### #   #  ###
 #   #  #  ##  # #
 ####   #  # # #  ###
 #      #  #  ##     #
 #     ### #   #  #*/

/* Like the 28-pin parts, the 32-pin DD's have a layout and
 * numbering scheme identical to the DA/DBm just with more analog pins. */

#define PIN_PA0 (0)
#define PIN_PA1 (1)
#define PIN_PA2 (2)
#define PIN_PA3 (3)
#define PIN_PA4 (4)
#define PIN_PA5 (5)
#define PIN_PA6 (6)
#define PIN_PA7 (7)
#define PIN_PC0 (8)
#define PIN_PC1 (9)
#define PIN_PC2 (10)
#define PIN_PC3 (11)
#define PIN_PD0 (12)
#define PIN_PD1 (13)
#define PIN_PD2 (14)
#define PIN_PD3 (15)
#define PIN_PD4 (16)
#define PIN_PD5 (17)
#define PIN_PD6 (18)
#define PIN_PD7 (19)
#define PIN_PF0 (20)
#define PIN_PF1 (21)
#define PIN_PF2 (22)
#define PIN_PF3 (23)
#define PIN_PF4 (24)
#define PIN_PF5 (25)
#define PIN_PF6 (26) // RESET
#define PIN_PF7 (27) // UPDI


        /*##   ##   ###  ###  ###  ###
        #   # #  # #      #  #    #
        ####  ####  ###   #  #     ###
        #   # #  #     #  #  #        #
        ####  #  # ####  ###  ###  #*/

#define PINS_COUNT                     (28)
#define NUM_ANALOG_INPUTS              (26)
// #define NUM_RESERVED_PINS            0     // These may at your option be defined,
// #define NUM_INTERNALLY_USED_PINS     0     // They will be filled in with defaults otherwise
// Autocalculated are :
// NUM_DIGITAL_PINS = PINS_COUNT - NUM_RESERVED_PINS
// TOTAL_FREE_OPINS = NUM_DIGITAL_PINS - NUM_INTERNALLY_USED_PINS
// Count of I2C and SPI pins will be defined as 2 and 3 but not used in further calculations. If you
// for some reason need to change this, define them here. Only ones not defined here get automatically set.
  #define LED_BUILTIN                  PIN_PA7

/* Until the legacy attach interrupt has been completely obsoleted - this is such a waste here! */
#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS        48
#endif

       /*   #  ###   ### ####   ###   ###
        ## ## #   # #    #   # #   # #
        # # # ##### #    ####  #   #  ###
        #   # #   # #    # #   #   #     #
        #   # #   #  ### #  #   ###   ##*/
// If you change the number of pins in any way or if the part has ADC on different pins from the board you are adapting
// you must ensure that these will do what they say they will do.
// that bit about the 4 ADC ADC channels on PORTC not working with MVIO enabled is ugly to handle.

#define digitalPinToAnalogInput(p)           ((p) >= PIN_PD0 ? (((p) < PIN_PF0) ? (p) - PIN_PD0 : ((p) < PIN_PF6 ? ((p) - 4) : NOT_A_PIN)):(((p) > PIN_PA1) ? (p) + 20 : NOT_A_PIN))
#define analogChannelToDigitalPin(p)         ((p) > 31 ? NOT_A_PIN : ((p) < 8 ? ((p) + PIN_PD0) : (p) > 21 ? (p) - 20 : (((p) > 15 ? (p + 4)) : NOT_A_PIN)))


#define analogInputToDigitalPin(p)                        analogChannelToDigitalPin((p) & 0x7F)
#define digitalOrAnalogPinToDigital(p)    (((p) & 0x80) ? analogChannelToDigitalPin((p) & 0x7f) : (((p)<=NUM_DIGITAL_PINS) ? (p) : NOT_A_PIN))
#define portToPinZero(port)               ((port) == PA ? PIN_PA0 : ((port) == PC ? PIN_PC0 : ((port) == PD ? PIN_PD0 : ((port) == PF ? PIN_PF0 : NOT_A_PIN))))


// PWM pins
#if defined(MILLIS_USE_TIMERB0)
  #define digitalPinHasPWMTCB(p)  ((p) == PIN_PF5)
#elif defined(MILLIS_USE_TIMERB1)
  #define digitalPinHasPWMTCB(p)  ((p) == PIN_PF4)
#else //no TCB's are used for millis
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PF4) || ((p) == PIN_PF5))
#endif

// Timer pin mapping
#define TCB0_PINS (0x00)                      // TCB0 output on PA2 (default) as the other options are not present on these parts.
#define TCB1_PINS (0x00)                      // TCB1 output on PA3 (default) as the other options are not present on these parts.
#define TCE0_PINS (0x02)                      // TCE0 initialized to PORTC, as it's present in it's entirety with all 4 PWM channels on all pincounts.
#define TCF0_PINS (0x02)                      // The PORTF option is obviously the best placec to put the TCF by default, though
#define PIN_TCB0_WO_INIT  (PIN_PA2)
#define PIN_TCB1_WO_INIT  (PIN_PA3)

#if defined(MILLIS_USE_TIMERF0)
  #define digitalPinHasPWM(p)               (digitalPinHasPWMTCB(p))
#else
  #define digitalPinHasPWM(p)               (digitalPinHasPWMTCB(p) || ((p) == PIN_PA0) || ((p) == PIN_PA1) || ((p) == PIN_PA6) || ((p) == PIN_PA7) || ((p) == PIN_PF4) || ((p) == PIN_PF5))
#endif

        /*##   ###  ####  ##### #   # #   # #   #
        #   # #   # #   #   #   ## ## #   #  # #
        ####  #   # ####    #   # # # #   #   #
        #     #   # #  #    #   #   # #   #  # #
        #      ###  #   #   #   #   #  ###  #   */

#define SPI_INTERFACES_COUNT   1

// In contrast to DA/DB with no pinswap options available, the DD has them in spades!
// defining SPI_MUX_PINSWAP_n is how we signal to SPI.h that a given option is valid
// for that part. PIN_PERIPHERALNSMR_

// SPI 0
#define SPI_MUX                                   (0x00)
#define SPI_MUX_PINSWAP_1                         (0x01)
#define SPI_MUX_PINSWAP_3                         (0x03)
#define SPI_MUX_PINSWAP_4                         (0x04)
#define SPI_MUX_PINSWAP_5                         (0x05)
#define SPI_MUX_PINSWAP_6                         (0x06)
#define SPI_MUX_PINSWAP_NONE                      (PORTMUX_SPI0_NONE_gc)
#define PIN_SPI_MOSI                              (PIN_PA4)
#define PIN_SPI_MISO                              (PIN_PA5)
#define PIN_SPI_SCK                               (PIN_PA6)
#define PIN_SPI_SS                                (PIN_PA7)
#define PIN_SPI_MOSI_PINSWAP_3                    (PIN_PA0)
#define PIN_SPI_MISO_PINSWAP_3                    (PIN_PA1)
#define PIN_SPI_SCK_PINSWAP_3                     (PIN_PC0)
#define PIN_SPI_SS_PINSWAP_3                      (PIN_PC1)
#define PIN_SPI_MOSI_PINSWAP_4                    (PIN_PD4)
#define PIN_SPI_MISO_PINSWAP_4                    (PIN_PD5)
#define PIN_SPI_SCK_PINSWAP_4                     (PIN_PD6)
#define PIN_SPI_SS_PINSWAP_4                      (PIN_PD7)
#define PIN_SPI_MOSI_PINSWAP_5                    (PIN_PC0)
#define PIN_SPI_MISO_PINSWAP_5                    (PIN_PC1)
#define PIN_SPI_SCK_PINSWAP_5                     (PIN_PC2)
#define PIN_SPI_SS_PINSWAP_5                      (PIN_PC3)
#define PIN_SPI_MOSI_PINSWAP_6                    (PIN_PC1)
#define PIN_SPI_MISO_PINSWAP_6                    (PIN_PC2)
#define PIN_SPI_SCK_PINSWAP_6                     (PIN_PC3)
#define PIN_SPI_SS_PINSWAP_6                      (PIN_PF7)


// TWI 0
#define PIN_WIRE_SDA                              (PIN_PA2)
#define PIN_WIRE_SCL                              (PIN_PA3)
#define PIN_WIRE_SDA_PINSWAP_2                    (PIN_PC2)
#define PIN_WIRE_SCL_PINSWAP_2                    (PIN_PC3)
#define PIN_WIRE_SDA_PINSWAP_3                    (PIN_PA0)
#define PIN_WIRE_SCL_PINSWAP_3                    (PIN_PA1)


