SpenceKonde/DxCore/megaavr/variants/32pin-ebseries/pins_arduino.h
// USART 0
#define HWSERIAL0_MUX                             (0x00 /* PORTMUX_USART0_DEFAULT_gc */)
#define HWSERIAL0_MUX_PINSWAP_1                   (0x01 /* PORTMUX_USART0_ALT1_gc */)
#define HWSERIAL0_MUX_PINSWAP_2                   (0x02 /* PORTMUX_USART0_ALT2_gc */)
#define HWSERIAL0_MUX_PINSWAP_3                   (0x03 /* PORTMUX_USART0_ALT3_gc */)
#define HWSERIAL0_MUX_PINSWAP_4                   (0x04 /* PORTMUX_USART0_ALT4_gc */)
#define HWSERIAL0_MUX_PINSWAP_5                   (0x06 /* PORTMUX_USART0_ALT6_gc */)
#define HWSERIAL0_MUX_PINSWAP_NONE                (0x07)
#define PIN_HWSERIAL0_TX                          (PIN_PA0)
#define PIN_HWSERIAL0_RX                          (PIN_PA1)
#define PIN_HWSERIAL0_XCK                         (PIN_PA2)
#define PIN_HWSERIAL0_XDIR                        (PIN_PA3)
#define PIN_HWSERIAL0_TX_PINSWAP_1                (PIN_PA4)
#define PIN_HWSERIAL0_RX_PINSWAP_1                (PIN_PA5)
#define PIN_HWSERIAL0_XCK_PINSWAP_1               (PIN_PA6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_1              (PIN_PA7)
#define PIN_HWSERIAL0_TX_PINSWAP_2                (PIN_PA2)
#define PIN_HWSERIAL0_RX_PINSWAP_2                (PIN_PA3)
#define PIN_HWSERIAL0_XCK_PINSWAP_2               (NOT_A_PIN)
#define PIN_HWSERIAL0_XDIR_PINSWAP_2              (NOT_A_PIN)
#define PIN_HWSERIAL0_TX_PINSWAP_3                (PIN_PD4)
#define PIN_HWSERIAL0_RX_PINSWAP_3                (PIN_PD5)
#define PIN_HWSERIAL0_XCK_PINSWAP_3               (PIN_PD6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_3              (PIN_PD7)
#define PIN_HWSERIAL0_TX_PINSWAP_4                (PIN_PC1)
#define PIN_HWSERIAL0_RX_PINSWAP_4                (PIN_PC2)
#define PIN_HWSERIAL0_XCK_PINSWAP_4               (PIN_PC3)
#define PIN_HWSERIAL0_XDIR_PINSWAP_4              (NOT_A_PIN)
#define PIN_HWSERIAL0_TX_PINSWAP_5                (PIN_PF7)
#define PIN_HWSERIAL0_RX_PINSWAP_5                (PIN_PF6)
#define PIN_HWSERIAL0_XCK_PINSWAP_5               (NOT_A_PIN)
#define PIN_HWSERIAL0_XDIR_PINSWAP_5              (NOT_A_PIN)

        /*##  #   #  ###  #     ###   ###      ####  ### #   #  ###
        #   # ##  # #   # #    #   # #         #   #  #  ##  # #
        ##### # # # ##### #    #   # #  ##     ####   #  # # #  ###
        #   # #  ## #   # #    #   # #   #     #      #  #  ##     #
        #   # #   # #   # ####  ###   ###      #     ### #   #  #*/


#define PIN_A0             (PIN_PD0)
#define PIN_A1             (PIN_PD1)
#define PIN_A2             (PIN_PD2)
#define PIN_A3             (PIN_PD3)
#define PIN_A4             (PIN_PD4)
#define PIN_A5             (PIN_PD5)
#define PIN_A6             (PIN_PD6)
#define PIN_A7             (PIN_PD7)
#define PIN_A8             (NOT_A_PIN) /* No PORTE on EB's */
#define PIN_A9             (NOT_A_PIN)
#define PIN_A10            (NOT_A_PIN)
#define PIN_A11            (NOT_A_PIN)
#define PIN_A12            (NOT_A_PIN)
#define PIN_A13            (NOT_A_PIN)
#define PIN_A14            (NOT_A_PIN)
#define PIN_A15            (NOT_A_PIN) /* End of what would be on PORTE */
#define PIN_A16            (PIN_PF0)
#define PIN_A17            (PIN_PF1)
#define PIN_A18            (PIN_PF2)
#define PIN_A19            (PIN_PF3)
#define PIN_A20            (PIN_PF4)
#define PIN_A21            (PIN_PF5)
/* No ADC on reset         PIN_PF6 (reset) */
/* No ADC on updi          PIN_PF7 (UPDI) */
/* No ADC on or            PIN_PA0 (XTAL1) */
/* No ADC on crystal pins  PIN_PA1 (XTAL2) */
#define PIN_A22            (PIN_PA2)
#define PIN_A23            (PIN_PA3)
#define PIN_A24            (PIN_PA4)
#define PIN_A25            (PIN_PA5)
#define PIN_A26            (PIN_PA6)
#define PIN_A27            (PIN_PA7)
#define PIN_A28            (PIN_PC0)
#define PIN_A29            (PIN_PC1)
#define PIN_A30            (PIN_PC2)
#define PIN_A31            (PIN_PC3)

static const uint8_t A0  = PIN_A0;
static const uint8_t A1  = PIN_A1;
static const uint8_t A2  = PIN_A2;
static const uint8_t A3  = PIN_A3;
static const uint8_t A4  = PIN_A4;
static const uint8_t A5  = PIN_A5;
static const uint8_t A6  = PIN_A6;
static const uint8_t A7  = PIN_A7;
static const uint8_t A8  = NOT_A_PIN;
static const uint8_t A9  = NOT_A_PIN;
static const uint8_t A10 = NOT_A_PIN;
static const uint8_t A11 = NOT_A_PIN;
static const uint8_t A12 = NOT_A_PIN;
static const uint8_t A13 = NOT_A_PIN;
static const uint8_t A14 = NOT_A_PIN;
static const uint8_t A15 = NOT_A_PIN;
static const uint8_t A16 = PIN_A16;
static const uint8_t A17 = PIN_A17;
static const uint8_t A18 = PIN_A18;
static const uint8_t A19 = PIN_A19;
static const uint8_t A20 = PIN_A20;
static const uint8_t A21 = PIN_A21;
static const uint8_t A22 = PIN_A22;
static const uint8_t A23 = PIN_A23;
static const uint8_t A24 = PIN_A24;
static const uint8_t A25 = PIN_A25;
static const uint8_t A26 = PIN_A26;
static const uint8_t A27 = PIN_A27;
static const uint8_t A28 = PIN_A28;
static const uint8_t A29 = PIN_A29;
static const uint8_t A30 = PIN_A30;
static const uint8_t A31 = PIN_A31;

#define AIN0               ADC_CH(0)
#define AIN1               ADC_CH(1)
#define AIN2               ADC_CH(2)
#define AIN3               ADC_CH(3)
#define AIN4               ADC_CH(4)
#define AIN5               ADC_CH(5)
#define AIN6               ADC_CH(6)
#define AIN7               ADC_CH(7)
#define AIN8               NOT_A_PIN
#define AIN9               NOT_A_PIN
#define AIN10              NOT_A_PIN
#define AIN11              NOT_A_PIN
#define AIN12              NOT_A_PIN
#define AIN13              NOT_A_PIN
#define AIN14              NOT_A_PIN
#define AIN15              NOT_A_PIN
#define AIN16              ADC_CH(16)
#define AIN17              ADC_CH(17)
#define AIN18              ADC_CH(18)
#define AIN19              ADC_CH(19)
#define AIN20              ADC_CH(20)
#define AIN21              ADC_CH(21)
#define AIN22              ADC_CH(22)
#define AIN23              ADC_CH(23)
#define AIN24              ADC_CH(24)
#define AIN25              ADC_CH(25)
#define AIN26              ADC_CH(26)
#define AIN27              ADC_CH(27)
#define AIN28              ADC_CH(28)
#define AIN29              ADC_CH(29)
#define AIN30              ADC_CH(30)
#define AIN31              ADC_CH(31)



        /*##  ### #   #      ###  ####  ####   ###  #   #  ###
        #   #  #  ##  #     #   # #   # #   # #   #  # #  #
        ####   #  # # #     ##### ####  ####  #####   #    ###
        #      #  #  ##     #   # #  #  #  #  #   #   #       #
        #     ### #   #     #   # #   # #   # #   #   #    #*/

#ifdef ARDUINO_MAIN

const uint8_t digital_pin_to_port[] = {
  PA,         //  0 PA0/USART0_Tx/CLKIN
  PA,         //  1 PA1/USART0_Rx
  PA,         //  2 PA2/AIN22/SDA
  PA,         //  3 PA3/AIN23/SCL
  PA,         //  4 PA4/AIN24/MOSI
  PA,         //  5 PA5/AIN25/MISO
  PA,         //  6 PA6/AIN26/SCK
  PA,         //  7 PA7/AIN27/SS/CLKOUT/LED_BUILTIN
  PC,         //  8 PC0/AIN28
  PC,         //  9 PC1/AIN29
  PC,         // 10 PC2/AIN30
  PC,         // 11 PC3/AIN31
  PD,         // 12 PD0/AIN0
  PD,         // 13 PD1/AIN1
  PD,         // 14 PD2/AIN2
  PD,         // 15 PD3/AIN3
  PD,         // 16 PD4/AIN4
  PD,         // 17 PD5/AIN5
  PD,         // 18 PD6/AIN6
  PD,         // 19 PD7/AIN7/AREF
  PF,         // 20 PF0/AIN16
  PF,         // 21 PF1/AIN17
  PF,         // 22 PF2/AIN18
  PF,         // 23 PF3/AIN19
  PF,         // 24 PF4/AIN20
  PF,         // 25 PF5/AIN21
  PF,         // 26 PF6 RESET
  PF          // 27 PF7 UPDI
};

